class Type {

  late int value;
  late String name;

  
  Type(this.value, this.name);

    static List<Type> getType(){
      return[
        Type(0, ''),
        Type(1, 'เกี่ยวกับการกู้ยืมเงินที่เป็นการฉ้อโกงประชาชน'),
        Type(2, 'เกี่ยวกับการแลกเปลี่ยนเงิน'),
        Type(3, 'เกี่ยวกับการเสนอราคาต่อหน่วยงานของรัฐ	'),
        Type(4, 'เกี่ยวกับเครื่องหมายการค้า'),
        Type(5, 'เกี่ยวกับบริษัทมหาชนจำกัด'),
        Type(6, 'เกี่ยวกับการฟอกเงิน'),
        Type(7, 'เกี่ยวกับสิทธิบัตร'),
        Type(8, 'เกี่ยวกับหลักทรัพย์และตลาดหลักทรัพย์'),
        Type(9, 'เกี่ยวกับศุลกากร'),
        Type(10, 'เกี่ยวกับภาษีสรรพสามิต'),
        Type(11, 'เกี่ยวกับการกระทำความผิดเกี่ยวกับคอมพิวเตอร์'),
        Type(12, 'เกี่ยวกับการประกอบธุรกิจของคนต่างด้าว'),
        Type(13, 'เกี่ยวกับการค้ามนุษย์'),
        Type(14, 'เกี่ยวกับแร่'),
        Type(15, 'เกี่ยวกับธุรกิจสถาบันการเงิน'),
        Type(16, 'เกี่ยวกับวัตถุอันตราย'),
        Type(17, 'เกี่ยวกับการสงวนและคุ้มครองสัตว์ป่า'),
        Type(18, 'เกี่ยวกับป่าไม้'),
        Type(19, 'เกี่ยวกับป่าสงวนแห่งชาติ'),
        Type(20, 'เกี่ยวกับอุทยานแห่งชาติ')
      ];
    }
}
